


## 001 ###################################### Personalizar Apariencia ##############################

#### iconos
code --install-extension PKief.material-icon-theme

#### tema
code --install-extension zhuangtongfa.material-theme
code --install-extension EliverLara.andromeda

######################################## Utilidades de Texto #######################################

#### ordena varias lineas de texto en orden alfabetico al presionar <f9>
code --install-extension Tyriar.sort-lines

######################################## Para hacer auto commites ##################################

code --install-extension vsls-contrib.gitdoc

######################################## Para verificar ortografia  ################################

code --install-extension streetsidesoftware.code-spell-checker
code --install-extension streetsidesoftware.code-spell-checker-spanish

######################################## Para colorear los corchetes ###############################

code --install-extension CoenraadS.bracket-pair-colorizer-2

######################################## Para ocultar carptas bajo demanda##########################

code --install-extension PeterSchmalfeldt.explorer-exclude

######################################## Para cargar varias areas de trabajo de una sola ves #######

code --install-extension tomsaunders.vscode-workspace-explorer

######################################## crea paréntesis de cierre y sale de ellos con tab #########

code --install-extension OnlyLys.leaper

######################################## Abre pdfs dentro de VSCode ################################
code --install-extension tomoki1207.pdf

######################################## No necesita explicación ###################################
code --install-extension GitHub.copilot

######################################## HTML  #####################################################
code --install-extension anteprimorac.html-end-tag-labels # Cierra viñetas html



######################################## git #######################################################
code --install-extension GitHub.vscode-pull-request-github
code --install-extension eamodio.gitlens
code --install-extension henriqueBruno.github-repository-manager
code --install-extension huizhou.githd
code --install-extension letmaik.git-tree-compare
code --install-extension mhutchie.git-graph
code --install-extension vsls-contrib.gistfs
code --install-extension Andreabbondanza.ignoregit
code --install-extension donjayamanne.githistory

######################################## Markdown ##################################################
code --install-extension telesoho.vscode-markdown-paste-image
code --install-extension yzhang.markdown-all-in-one
code --install-extension bierner.markdown-checkbox
code --install-extension bierner.markdown-emoji
code --install-extension bierner.markdown-preview-github-styles
code --install-extension bierner.markdown-yaml-preamble
code --install-extension mathpix.vscode-mathpix-markdown
code --install-extension sndst00m.markdown-github-dark-pack
code --install-extension bierner.emojisense


######################################## FLUTTER ###################################################
#code --install-extension Dart-Code.dart-code
#code --install-extension Dart-Code.flutter
#code --install-extension DiemasMichiels.emulate
#code --install-extension FelixAngelov.bloc
#code --install-extension alexisvt.flutter-snippets
#code --install-extension localizely.flutter-intl
#code --install-extension wangxinhai-ref-chunsen.flutter-code-select
#code --install-extension yt1997kt.flutter-bloc
#code --install-extension jeroen-meijer.pubspec-assist
#code --install-extension orestesgaolin.dart-export-index
#code --install-extension pflannery.vscode-versionlens
#code --install-extension luanpotter.dart-import


######################################## JAVA ######################################################
#code --install-extension georgewfraser.vscode-javac
#code --install-extension redhat.java
#code --install-extension vscjava.vscode-java-debug
#code --install-extension vscjava.vscode-java-dependency
#code --install-extension vscjava.vscode-java-pack
#code --install-extension vscjava.vscode-java-test
#code --install-extension vscjava.vscode-maven
#code --install-extension vscjava.vscode-spring-boot-dashboard
#code --install-extension vscjava.vscode-spring-initializr
#code --install-extension Pivotal.vscode-boot-dev-pack
#code --install-extension Pivotal.vscode-spring-boot
#code --install-extension redhat.vscode-xml
#code --install-extension redhat.vscode-yaml





######################################## CPP #######################################################
#code --install-extension ms-vscode.cmake-tools
#code --install-extension ms-vscode.cpptools
#code --install-extension ms-vscode.cpptools-extension-pack
#code --install-extension ms-vscode.cpptools-themes
#code --install-extension twxs.cmake


######################################## DOTNET#####################################################

code --install-extension ms-dotnettools.csharp
code --install-extension jchannon.csharpextensions




######################################## CONTENEDORES ##############################################

code --install-extension ms-vscode-remote.vscode-remote-extensionpack
code --install-extension ms-vscode-remote.remote-containers
code --install-extension ms-kubernetes-tools.vscode-kubernetes-tools
code --install-extension ms-azuretools.vscode-docker


######################################## TEST COBERTURA ############################################

code --install-extension ryanluker.vscode-coverage-gutters
code --install-extension ritwickdey.LiveServer
code --install-extension ms-vscode.live-server


######################################## Error Lens ################################################
code --install-extension usernamehw.errorlens



######################################## Resaltado de los Todos ####################################
code --install-extension Gruntfuggly.todo-tree
code --install-extension wayou.vscode-todo-highlight


######################################## Creador de Snippets #######################################
code --install-extension wenfangdu.snippet-generator

######################################## Para el explorador de archivos ############################
code --install-extension carlocardella.vscode-filesystemtoolbox

######################################## Para el anotador de bookmarks #############################
code --install-extension alefragnani.Bookmarks

######################################## Para el anotador de bookmarks #############################
code --install-extension jspolancor.presentationmode

######################################## Code Runeer ###############################################
code --install-extension formulahendry.code-runner


#######################################EXCEL Y CSV ##############^^#################################
code --install-extension GrapeCity.gc-excelviewer
code --install-extension mechatroner.rainbow-csv



####################################### para colorear los logs #####################################
code --install-extension IBM.output-colorizer

