


## 001 ###################################### Personalizar Apariencia ##############################

#### iconos
code --install-extension PKief.material-icon-theme

#### tema
code --install-extension zhuangtongfa.material-theme
code --install-extension EliverLara.andromeda

######################################## Utilidades de Texto #######################################

#### ordena varias lineas de texto en orden alfabetico al presionar <f9>
code --install-extension Tyriar.sort-lines

######################################## Para hacer auto commites ##################################

code --install-extension vsls-contrib.gitdoc

######################################## Para verificar ortografia  ################################

code --install-extension streetsidesoftware.code-spell-checker
code --install-extension streetsidesoftware.code-spell-checker-spanish

######################################## Para colorear los corchetes ###############################

code --install-extension CoenraadS.bracket-pair-colorizer-2

######################################## Para ocultar carptas bajo demanda##########################

code --install-extension PeterSchmalfeldt.explorer-exclude

######################################## Para cargar varias areas de trabajo de una sola ves #######

code --install-extension tomsaunders.vscode-workspace-explorer

######################################## crea paréntesis de cierre y sale de ellos con tab #########

code --install-extension OnlyLys.leaper

######################################## Abre pdfs dentro de VSCode ################################
code --install-extension tomoki1207.pdf

######################################## No necesita explicación ###################################
code --install-extension GitHub.copilot

######################################## HTML  #####################################################
code --install-extension anteprimorac.html-end-tag-labels # Cierra viñetas html



######################################## git #######################################################
code --install-extension GitHub.vscode-pull-request-github
code --install-extension eamodio.gitlens
code --install-extension henriqueBruno.github-repository-manager
code --install-extension huizhou.githd
code --install-extension letmaik.git-tree-compare
code --install-extension mhutchie.git-graph
code --install-extension vsls-contrib.gistfs

######################################## Markdown ##################################################
code --install-extension telesoho.vscode-markdown-paste-image
code --install-extension yzhang.markdown-all-in-one
code --install-extension bierner.markdown-checkbox
code --install-extension bierner.markdown-emoji
code --install-extension bierner.markdown-preview-github-styles
code --install-extension bierner.markdown-yaml-preamble
code --install-extension mathpix.vscode-mathpix-markdown
code --install-extension sndst00m.markdown-github-dark-pack


######################################## FLUTTER ###################################################
#code --install-extension Dart-Code.dart-code
#code --install-extension Dart-Code.flutter
#code --install-extension DiemasMichiels.emulate
#code --install-extension FelixAngelov.bloc
#code --install-extension alexisvt.flutter-snippets
#code --install-extension localizely.flutter-intl
#code --install-extension wangxinhai-ref-chunsen.flutter-code-select
#code --install-extension yt1997kt.flutter-bloc




